// 0. Задача 1: Задайте двумерный массив размера m на n, каждый
//    элемент в массиве находится по формуле: A[][] = m+n.
//    Выведите полученный массив на экран.

void PrintArray(int[,] matr)
{
    for (int i = 0; i < matr.GetLength(0); i++)
    {
        for (int j = 0; j < matr.GetLength(1); j++)
        {
            Console.Write($"{matr[i, j],3} ");
        }
        Console.WriteLine();
    }
}

void FillArray(int[,] matr)
{
    Console.WriteLine("\nМассив:");
    for (int i = 0; i < matr.GetLength(0); i++)
    {
        for (int j = 0; j < matr.GetLength(1); j++)
        {
            matr[i,j] = i+j;
        }
    }
}



Console.WriteLine("Введите количество столбцов ");
int m = int.Parse(Console.ReadLine()!);
Console.WriteLine("Введите количество строк ");
int n = int.Parse(Console.ReadLine()!);
int[,] matrix = new int[m, n];
FillArray(matrix);
PrintArray(matrix);